//Задача 10: Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.
/*
void ShowNumber (int num)
{
    int firstNum = num / 10;
    int secondNum = firstNum % 10;

    Console.Write(num + " -> ");
    Console.Write(secondNum);
    
}
int num = new Random().Next(100, 999);
ShowNumber(num);
*/



